t1 = (80, 95, 78, 50, 76, 80, 85, 20)       #定义元组就是组包
t2 = 80, 95, 78, 50, 76, 80, 85, 20         #元组可以不带括号


#基础解包
a, b, c, d, e, f, g, h = t1     #变量数量要与元组中元素数量一致
print(a)  # 80
print(b)  # 95
print(c)  # 78
print(d)  # 50
print(e)  # 76
print(f)  # 80
print(g)  # 85
print(h)  # 20

print("===============================")

#如果变量数量少于元组元素数量，就要用*收集多余元素
a, b, c, *rest = t1
print(a)     # 80
print(b)     # 95
print(c)     # 78
print(rest)  # [50, 76, 80, 85, 20]（列表形式）

print("===============================")

#这样用*收集元素也可以
a, *b, c, d = t1
print(a)
print(b)
print(c)
print(d)

print("===============================")

#或者用*_抛弃多余元素
a, b, c, d, *_ = t1
print(a)  # 80
print(b)  # 95
print(c)  # 78
print(d)  # 50

print("===============================")



